#### Terraform Plan 📖
```
data.archive_file.reminder_placeholder: Reading...
data.archive_file.lambda_placeholder: Reading...
data.archive_file.reminder_placeholder: Read complete after 0s [id=cdff0b9394765f7b7b211f3271c665297c137ddc]
data.archive_file.lambda_placeholder: Read complete after 0s [id=c654ac7fe38c74461c5f67c0d125e5b89862ced9]
aws_acm_certificate.grimoire: Refreshing state... [id=arn:aws:acm:us-east-1:572731307397:certificate/a9dd9576-2049-46b9-9738-a5d15ec22640]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-2:572731307397:certificate/18d5216b-630b-4193-8974-6464f10774dc]
aws_dynamodb_table.invites: Refreshing state... [id=grimoire-invites-dev]
data.aws_route53_zone.main: Reading...
aws_dynamodb_table.polls: Refreshing state... [id=grimoire-polls-dev]
aws_cloudwatch_event_rule.daily_reminder: Refreshing state... [id=grimoire-daily-reminder-dev]
aws_dynamodb_table.sessions: Refreshing state... [id=grimoire-sessions-dev]
aws_dynamodb_table.responses: Refreshing state... [id=grimoire-responses-dev]
aws_apigatewayv2_api.main: Refreshing state... [id=x27f69nlxj]
aws_dynamodb_table.push_subscriptions: Refreshing state... [id=grimoire-push-subscriptions-dev]
aws_s3_bucket.frontend: Refreshing state... [id=grimoire-frontend-dev]
aws_dynamodb_table.users: Refreshing state... [id=grimoire-users-dev]
aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E1Y6W4CIG6VYWP]
aws_dynamodb_table.refresh_tokens: Refreshing state... [id=grimoire-refresh-tokens-dev]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/grimoire-api-dev]
aws_iam_role.lambda_exec: Refreshing state... [id=grimoire-lambda-exec-dev]
aws_dynamodb_table.campaign_members: Refreshing state... [id=grimoire-campaign-members-dev]
aws_dynamodb_table.campaigns: Refreshing state... [id=grimoire-campaigns-dev]
data.aws_route53_zone.main: Read complete after 1s [id=Z0565481JJ8IO6652VY5]
aws_route53_record.api_cert_validation["api.dev-grimoire.habernashing.com"]: Refreshing state... [id=Z0565481JJ8IO6652VY5__07e96653a46832ab550a76ef27c1aa22.api.dev-grimoire.habernashing.com._CNAME]
aws_route53_record.acm_validation["dev-grimoire.habernashing.com"]: Refreshing state... [id=Z0565481JJ8IO6652VY5__b11c35d396b12df971ca494fcc277813.dev-grimoire.habernashing.com._CNAME]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_lambda_function.reminder: Refreshing state... [id=grimoire-reminder-dev]
aws_acm_certificate_validation.api: Refreshing state... [id=2026-03-07 20:19:48.467 +0000 UTC]
aws_acm_certificate_validation.grimoire: Refreshing state... [id=2026-03-07 18:27:54.175 +0000 UTC]
aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.dev-grimoire.habernashing.com]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=grimoire-frontend-dev]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E3Q7W44CEV5CAT]
aws_apigatewayv2_api_mapping.api: Refreshing state... [id=jmiy8o]
aws_route53_record.api: Refreshing state... [id=Z0565481JJ8IO6652VY5_api.dev-grimoire.habernashing.com_A]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
aws_cloudwatch_log_group.reminder: Refreshing state... [id=/aws/lambda/grimoire-reminder-dev]
aws_cloudwatch_event_target.reminder_target: Refreshing state... [id=grimoire-daily-reminder-dev-terraform-20260308013230357100000001]
aws_route53_record.frontend: Refreshing state... [id=Z0565481JJ8IO6652VY5_dev-grimoire.habernashing.com_A]
data.aws_iam_policy_document.frontend_bucket_policy: Reading...
aws_route53_record.frontend_ipv6: Refreshing state... [id=Z0565481JJ8IO6652VY5_dev-grimoire.habernashing.com_AAAA]
data.aws_iam_policy_document.frontend_bucket_policy: Read complete after 0s [id=3408950843]
aws_s3_bucket_policy.frontend: Refreshing state... [id=grimoire-frontend-dev]
aws_lambda_function.api: Refreshing state... [id=grimoire-api-dev]
aws_iam_role_policy.lambda_permissions: Refreshing state... [id=grimoire-lambda-exec-dev:grimoire-lambda-permissions-dev]
aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/grimoire-api-dev]
aws_apigatewayv2_integration.lambda: Refreshing state... [id=r6cz8z5]
aws_apigatewayv2_route.catch_all: Refreshing state... [id=gzsazf1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.session_notes will be created
  + resource "aws_dynamodb_table" "session_notes" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "sessionId"
      + id               = (known after apply)
      + name             = "grimoire-session-notes-dev"
      + range_key        = "noteId"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "grimoire"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "noteId"
          + type = "S"
        }
      + attribute {
          + name = "sessionId"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_role_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_permissions" {
        id          = "grimoire-lambda-exec-dev:grimoire-lambda-permissions-dev"
        name        = "grimoire-lambda-permissions-dev"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:Query",
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-users-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-users-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-refresh-tokens-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-refresh-tokens-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-push-subscriptions-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-push-subscriptions-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-polls-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-polls-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-responses-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-responses-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-invites-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-invites-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-sessions-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-sessions-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-campaigns-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-campaigns-dev/index/*",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-campaign-members-dev",
                          - "arn:aws:dynamodb:us-east-2:572731307397:table/grimoire-campaign-members-dev/index/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-2:*:*"
                    },
                  - {
                      - Action   = [
                          - "ses:SendEmail",
                          - "ses:SendRawEmail",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "grimoire-api-dev"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "JWT_SECRET"             = (sensitive value)
              + "TABLE_SESSION_NOTES"    = "grimoire-session-notes-dev"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Plan: `success`*